<?php

return [
    'title' => 'Товары в вашей корзине',
    'bread' => 'Корзина',
    'itemName' => 'Наименование',
    'unit' => 'Цена',
    'total' => 'всего',
    'refresh' => 'Обновить товары в корзине',
    'empty' => "В корзине нет товаров",
    'continue' => 'Продолжить покупки',
    'order' => [
        'checkout' => 'Оформления заказа',
        'title' => 'Пожалуйста, предоставьте информацию о вас',
        'uDetails' => 'Информация о пользователе',
        'name' => 'ФИО',
        'phone' => 'Телефон',
        'email' => 'Email',
        'addressDetails' => 'Детали доставки',
        'address' => 'Адрес доставки',
        'courier' => 'доставка курьером по Киеву',
        'nova' => 'отправка Новой Почтой',
        'without-call' => 'Не перезванивать мне',
        'Confirmation' => 'Подтверждение',
        'conf-title' => 'Шаг 2 из 2 - подтверждение заказа',
        'dsTitle' => 'Иформация о доставке/заказчике',
        'sMethod' => 'Способ доставки',
        'special' => 'Особые инструкции или комментарии к заказу',
        'confirm' => 'Подтвердить заказ'
    ]
];
