<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Global common words for site
    |--------------------------------------------------------------------------
    */

    'categories' => 'Категории',
    'contacts' => 'Контакты',
    'articles' => 'Статьи',
    'Manufacturers' => 'Производители',
    'gallery' => 'Галерея',
    'new' => 'новинка',
    'Cart' => 'Корзина',
    'empty' => 'пусто',
    'Subcategories' => 'Подкатегории',
    'featured' => 'Рекомендуемые товары',
    'Details' => 'Подробнее',
    'checkout' => 'Оформить',
    'quantity' => 'Количество',
    'delete' => 'удалить',
    'next' => 'Далее',
    'edit' => 'редактировать'
];
