<?php

return [
    'menu' => [
        'quick' => 'Быстрый доступ',
        'follow' => "Подписаться",
        'customers' => 'Клиентам',
        'home' => 'Главная',
        'brands' => 'Производители',
        'categories' => "Все категории",
        'shipping' => 'Доставка и оплата',
        'faq' => 'Часто задаваемые вопросы'
    ],
    'contact' => [
        'name' => 'Ваше имя',
        'message' => 'Сообщение',
        'send' => 'Отправить',
        'schedule' => 'График работы',
        'back' => 'Назад на главную'
    ]
];
