<?php

return [
    'title' => 'Товари в корзині',
    'bread' => 'Корзина',
    'itemName' => 'Назва продукту',
    'unit' => 'Ціна',
    'total' => 'підсумок',
    'refresh' => 'Оновити товари в кошику',
    'empty' => "У кошику немає товарів",
    'continue' => 'Продовжити покупки',
    'order' => [
        'checkout' => 'Оформлення заказу',
        'title' => 'Будь ласка, надайте інформацію про вас',
        'uDetails' => 'інформація про користувача',
        'name' => 'ПІБ',
        'phone' => 'Мобільний',
        'email' => 'Email',
        'addressDetails' => 'Деталі доставки',
        'address' => 'Адреса доставки',
        'courier' => 'Кур’єром по Київу',
        'nova' => 'Відправлення Новою Поштою',
        'without-call' => 'Можна не дзвонити мені',
        'Confirmation' => 'Підтвердження',
        'conf-title' => 'Шаг 2 із 2 - підтвердження заказу',
        'dsTitle' => 'Иформація про доставку та про користувача',
        'sMethod' => 'Спосіб доставки',
        'special' => 'Особливі інструкції або коментарі до замовлення',
        'confirm' => 'Підтвердити замовлення'
    ]
];
