<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Global common words for site
    |--------------------------------------------------------------------------
    */

    'categories' => 'Категорії',
    'contacts' => 'Контакти',
    'articles' => 'Статті',
    'Manufacturers' => 'Виробники',
    'gallery' => 'Галерея',
    'new' => 'new',
    'Cart' => 'Кошик',
    'empty' => 'пусто',
    'Subcategories' => 'Подкатегории',
    'featured' => 'Рекомендовані товари',
    'Details' => 'Детальніше',
    'checkout' => 'Оформити',
    'quantity' => 'Кількість',
    'delete' => 'видалити',
    'next' => 'Далі',
    'back' => 'Назад',
    'edit' => 'редагувати'
];
