<?php

return [
    'menu' => [
        'quick' => 'Швидкий доступ',
        'follow' => 'Підписатись',
        'customers' => 'Клієнтам',
        'home' => 'Головна',
        'brands' => 'Усі виробники',
        'categories' => "Усі категорії",
        'shipping' => 'Доставка та оплата',
        'faq' => 'Поширені запитання'
    ],
    'contact' => [
        'name' => 'Ваше ім’я',
        'message' => 'Повідомлення',
        'send' => 'Надіслати',
        'schedule' => 'Графік роботи',
        'back' => 'На головну'
    ]
];
